# About This Notebook
In this last chapter of the course, **Exploring Data with pandas: Intermediate**, we will learn:
- Select columns, rows and individual items using their integer location.
- Use `pd.read_csv()` to read CSV files in pandas.
- Work with integer axis labels.
- How to use pandas methods to produce boolean arrays.
- Use boolean operators to combine boolean comparisons to perform more complex analysis.
- Use index labels to align data.
- Use aggregation to perform advanced analysis using loops.
***
## 1. Reading CSV files with pandas(IMPORTANT)

In the previous notebook about the fundamentals of exploring data with pandas, we worked with Fortune Global 500 dataset. In this chapter, we will learn how to use the `pandas.read_csv()` function to read in CSV files.

Previously, we used the snippet below to read our CSV file into pandas.

In [1]:
import pandas as pd
f500 = pd.read_csv('../../../Data/csv/f500.csv', index_col=0)
f500.index.name = None
f500.head()

,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
Sinopec Group,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4,China,"Beijing, China",http://www.sinopec.com,19,713288,106523
China National Petroleum,4,262573,-12.3,1867.5,585619,-73.7,Zhang Jianhua,Petroleum Refining,Energy,3,China,"Beijing, China",http://www.cnpc.com.cn,17,1512048,301893
Toyota Motor,5,254694,7.7,16899.3,437575,-12.3,Akio Toyoda,Motor Vehicles and Parts,Motor Vehicles & Parts,8,Japan,"Toyota, Japan",http://www.toyota-global.com,23,364445,157210

But if you look closely, you may see that the index axis labels are the values from the first column in the data set, **company**:

company,rank,revenues,revenue_change
Walmart,1,485873,0.8
State Grid,2,315199,-4.4
Sinopec Group,3,267518,-9.1
China National Petroleum,4,262573,-12.3
Toyota Motor,5,254694,7.7

You will see that in the [`read_csv()` function](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html), the `index_col` parameter is optional from the official documentation. When we specify a value of `0`, the first column will be used as the row labels.

Compare with the dataframe above, notice how the `f500` dataframe looks like if we remove the second line using `f500.index.name = None`.

In [2]:
f500 = pd.read_csv('../../../Data/csv/f500.csv', index_col=0)
f500.head()

,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
company,,,,,,,,,,,,,,,,
Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
Sinopec Group,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4,China,"Beijing, China",http://www.sinopec.com,19,713288,106523
China National Petroleum,4,262573,-12.3,1867.5,585619,-73.7,Zhang Jianhua,Petroleum Refining,Energy,3,China,"Beijing, China",http://www.cnpc.com.cn,17,1512048,301893
Toyota Motor,5,254694,7.7,16899.3,437575,-12.3,Akio Toyoda,Motor Vehicles and Parts,Motor Vehicles & Parts,8,Japan,"Toyota, Japan",http://www.toyota-global.com,23,364445,157210

Do you see the text **company** above the index labels? This is the name of the first column in the CSV. This value is used as the **axis name** for the index axis in Pandas.

You see that both the column and index axes can have names assigned to them. Originally, we accessed the name of the index axes and set it to `None`, that's why the dataframe didn't have a name for the index axis.

### Task 3.5.1
1. Use the `pandas.read_csv()` function to read the `f500.csv` CSV file as a pandas dataframe. Assign it to the variable name `f500`.
    - Do not use the `index_col` parameter.
2. Use the following code to insert the NaN values (missing values) into the `previous_rank` column: <br>
````python
f500.loc[f500["previous_rank"] == 0, "previous_rank"] = np.nan
````
Remark: If you get a notice that `np` is not defined, you have to import NumPy by typing `import numpy as np`.

In [3]:
# Start your code below:

import pandas as pd
import numpy as np

f500 = pd.read_csv('../../../Data/csv/f500.csv')
f500.index.name = None

f500.loc[f500["previous_rank"] == 0, "previous_rank"] = np.nan
f500_selection = f500.loc[:,["rank","revenues", "revenue_change"]].head()

## 2. Using iloc to select by integer position

In the previous exercise we read our CSV file into pandas. But this time, we didn't use the `index_col` parameter:

In [4]:
f500 = pd.read_csv('../../../Data/csv/f500.csv')
print(f500[['company', 'rank', 'revenues']].head())

                    company  rank  revenues
0                   Walmart     1    485873
1                State Grid     2    315199
2             Sinopec Group     3    267518
3  China National Petroleum     4    262573
4              Toyota Motor     5    254694

There are two significant differences with the approach that we just took above:
- the **company** column is now included as a regular column, not as an index column
- the **index labels** now start from `0` as **integers**

This is the more conventional way how we should read in a dataframe, and we will be going with this method from now on.

However, do you still remember how we worked with a dataframe with **string index labels**? We used `loc[]` to select the data.

For selecting rows and columns by their integer positions, we use `iloc[]`. Using `iloc[]` is almost identical to indexing with NumPy, with integer positions starting at `0` like ndarrays and Python lists.

`DataFrame.iloc[]` behaves similarly to `DataFrame.loc[]`. The full syntax for `DataFrame.iloc[]`, in pseudocode, is: 

````python
df.iloc[row_index, column_index]
````

To help you memorize the two syntaxes easier:
- ``loc``: label based selection
- ``iloc``: integer position based selection

### Task 3.5.2
1. Select just the fifth row of the `f500` dataframe. Assign the result to `fifth_row`.
2. Select the value in the first row of the `company` column. Assign the result to `company_value`.

In [77]:
# Start your code below:

fifth_row = f500.iloc[4,:]
company_value = f500.iloc[0,0] # company is the first row

## 3. Using iloc to select by integer position continued

If we want to select the first column from our `f500` dataset, we need to use ``:``, a colon, to specify all rows, and then use the integer ``0`` to specify the first column, like this:

In [6]:
first_column = f500.iloc[:,0]
print(first_column)

0                                           Walmart
1                                        State Grid
2                                     Sinopec Group
3                          China National Petroleum
4                                      Toyota Motor
5                                        Volkswagen
6                                 Royal Dutch Shell
7                                Berkshire Hathaway
8                                             Apple
9                                       Exxon Mobil
10                                         McKesson
11                                               BP
12                               UnitedHealth Group
13                                       CVS Health
14                              Samsung Electronics
15                                         Glencore
16                                          Daimler
17                                   General Motors
18                                             AT&T
19                                       EXOR Group
20                                       Ford Motor
21            Industrial & Commercial Bank of China
22                                AmerisourceBergen
23             China State Construction Engineering
24                                              AXA
25                                       Amazon.com
26                       Hon Hai Precision Industry
27                          China Construction Bank
28                                      Honda Motor
29                                            Total
                           ...
470                                           Amgen
471                                  Rabobank Group
472                                          Altice
473                                            Onex
474                                US Foods Holding
475    Shanxi Jincheng Anthracite Coal Mining Group
476                                Randstad Holding
477                                Tencent Holdings
478                                      LG Display
479                                  Emirates Group
480                                    U.S. Bancorp
481                          H & M Hennes & Mauritz
482                                           Aflac
483                                          Sodexo
484                           Suning Commerce Group
485                                       GS Caltex
486                               Ultrapar Holdings
487                                      Xiamen C&D
488                                  Sears Holdings
489                        China General Technology
490                                   National Grid
491                                  Dollar General
492                                  Telecom Italia
493                        Xiamen ITG Holding Group
494           Xinjiang Guanghui Industry Investment
495                  Teva Pharmaceutical Industries
496                        New China Life Insurance
497                       Wm. Morrison Supermarkets
498                                             TUI
499                                      AutoNation
Name: company, Length: 500, dtype: object

To specify a positional slice, try to use the same shortcut that we used with labels. Below is an example how we would select the rows between index positions one to four (inclusive):

In [7]:
second_to_sixth_rows = f500[1:5]
print(second_to_sixth_rows)

                    company  rank  revenues  revenue_change  profits  assets  \
1                State Grid     2    315199            -4.4   9571.3  489838
2             Sinopec Group     3    267518            -9.1   1257.9  310726
3  China National Petroleum     4    262573           -12.3   1867.5  585619
4              Toyota Motor     5    254694             7.7  16899.3  437575

   profit_change            ceo                  industry  \
1           -6.2        Kou Wei                 Utilities
2          -65.0      Wang Yupu        Petroleum Refining
3          -73.7  Zhang Jianhua        Petroleum Refining
4          -12.3    Akio Toyoda  Motor Vehicles and Parts

                   sector  previous_rank country     hq_location  \
1                  Energy              2   China  Beijing, China
2                  Energy              4   China  Beijing, China
3                  Energy              3   China  Beijing, China
4  Motor Vehicles & Parts              8   Japan   Toyota, Japan

                        website  years_on_global_500_list  employees  \
1        http://www.sgcc.com.cn                        17     926067
2        http://www.sinopec.com                        19     713288
3        http://www.cnpc.com.cn                        17    1512048
4  http://www.toyota-global.com                        23     364445

   total_stockholder_equity
1                    209456
2                    106523
3                    301893
4                    157210

Pay attention to the fact that the row at index position `5` is not included, just as if we were slicing with a Python list or NumPy ndarray. Recall that `loc[]` handles slicing differently:

- With `loc[]`, the ending slice **is** included.
- With `iloc[]`, the ending slice **is not** included.

The table below summarizes the usage of `DataFrame.iloc[]` and `Series.iloc[]` to select by integer position:

|Select by integer position| Explicit Syntax| Shorthand Convention|
|--|--|--|
|Single column from dataframe|df.iloc[:,3]| |
|List of columns from dataframe|df.iloc[:,[3,5,6]] | |
|Slice of columns from dataframe|df.iloc[:,3:7]| |
|Single row from dataframe|df.iloc[20]| |
|List of rows from dataframe|df.iloc[[0,3,8]]| |
|Slice of rows from dataframe|df.iloc[3:5]|df[3:5]|
|Single items from series|s.iloc[8]|s[8]|
|List of item from series |s.iloc[[2,8,1]]|s[[2,8,1]]|
|Slice of items from series|s.iloc[5:10]|s[5:10]|

### Task 3.5.3
1. Select the first three rows of the `f500` dataframe. Assign the result to `first_three_rows`.
2. Select the first and seventh rows and the first five columns of the `f500` dataframe. Assign the result to `first_seventh_row_slice`.

In [8]:
# Start your code below:

first_three_rows = f500[:3]
first_seventh_row_slice = f500.iloc[[0, 6], :5]

print(first_three_rows)
print(first_seventh_row_slice)

         company  rank  revenues  revenue_change  profits  assets  \
0        Walmart     1    485873             0.8  13643.0  198825
1     State Grid     2    315199            -4.4   9571.3  489838
2  Sinopec Group     3    267518            -9.1   1257.9  310726

   profit_change                  ceo               industry     sector  \
0           -7.2  C. Douglas McMillon  General Merchandisers  Retailing
1           -6.2              Kou Wei              Utilities     Energy
2          -65.0            Wang Yupu     Petroleum Refining     Energy

   previous_rank country      hq_location                 website  \
0              1     USA  Bentonville, AR  http://www.walmart.com
1              2   China   Beijing, China  http://www.sgcc.com.cn
2              4   China   Beijing, China  http://www.sinopec.com

   years_on_global_500_list  employees  total_stockholder_equity
0                        23    2300000                     77798
1                        17     926067                    209456
2                        19     713288                    106523
             company  rank  revenues  revenue_change  profits
0            Walmart     1    485873             0.8  13643.0
6  Royal Dutch Shell     7    240033           -11.8   4575.0

## 4. Using pandas methods to create boolean masks

There are two methods that I want to introduce to you in this chapter, which are the `Series.isnull()` [method](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isnull.html) and `Series.notnull()` [method](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.notnull.html). These two methods can be either used to select rows that contain null (or NaN) values or to select rows that do **not** contain null values.

Let's first have a look at the `Series.isnull()` method, which is used to view rows with null values (i.e. missing values) in one column.
Here is an example for the `revenue_change` column:

In [10]:
rev_is_null = f500["revenue_change"].isnull()
print(rev_is_null.head())

0    False
1    False
2    False
3    False
4    False
Name: revenue_change, dtype: bool

We see that using `Series.isnull()` resulted in a boolean series. Just like in NumPy, we can use this series to filter our dataframe, `f500`:

In [11]:
import pandas as pd
import numpy as np

f500 = pd.read_csv("f500.csv")
f500.index.name = None


rev_change_null = f500[rev_is_null]
print(rev_change_null[["company", "country","sector"]])

                        company  country      sector
90                       Uniper  Germany      Energy
180  Hewlett Packard Enterprise      USA  Technology

### Task 3.5.4
1. Use the `Series.isnull()` method to select all rows from `f500` that have a null value for the `profit_change` column. Select only the `company`, `profits`, and `profit_change` columns. Assign the result to `null_profit_change`.

In [24]:
# Start your code below:

profit_change_bool  = f500["profit_change"].isnull()
null_profit_change = f500[profit_change_bool][["company", "profits", "profit_change"]]
print(null_profit_change)

                                          company  profits  profit_change
5                                      Volkswagen   5937.3            NaN
7                              Berkshire Hathaway  24074.0            NaN
11                                             BP    115.0            NaN
15                                       Glencore   1379.0            NaN
22                              AmerisourceBergen   1427.9            NaN
30                               General Electric   8831.0            NaN
74                                      Petrobras  -4838.0            NaN
90                                         Uniper  -3557.5            NaN
92                                          Engie   -458.9            NaN
98                            U.S. Postal Service  -5591.0            NaN
119                               China Minmetals   -446.7            NaN
123                             Dell Technologies  -1672.0            NaN
126                                 JXTG Holdings   1477.3            NaN
131                                           ENI  -1619.0            NaN
140                               Albertsons Cos.   -373.3            NaN
142                                Sinochem Group    468.0            NaN
144                                    Mitsubishi   4063.5            NaN
148                                Vodafone Group  -6904.0            NaN
151                                         Pemex -10256.3            NaN
155                                 ArcelorMittal   1779.0            NaN
180                    Hewlett Packard Enterprise   3161.0            NaN
188                                 Deutsche Bank  -1550.4            NaN
194                                           RWE  -6249.1            NaN
196                                       Finatis    687.8            NaN
203                       China Baowu Steel Group    442.8            NaN
204                                   Noble Group      8.7            NaN
206                                       Statoil  -2902.0            NaN
210                                     ChemChina     17.9            NaN
211                                 Deutsche Bahn    768.6            NaN
220                                    HBIS Group   -146.8            NaN
..                                            ...      ...            ...
248                                        Mitsui   2825.3            NaN
258        China National Building Material Group     74.5            NaN
260                                        JD.com   -573.0            NaN
283                                      Barclays   2807.4            NaN
285                                      Centrica   2256.7            NaN
305                                        Repsol   1919.7            NaN
312                      Hyundai Heavy Industries    469.8            NaN
315                               Rio Tinto Group   4617.0            NaN
316                                SNCF Mobilites    565.1            NaN
319                          Jizhong Energy Group   -153.9            NaN
325            Shaanxi Yanchang Petroleum (Group)    -22.6            NaN
336              Shaanxi Coal & Chemical Industry   -254.4            NaN
338                                Jiangxi Copper     20.4            NaN
353                           Credit Suisse Group  -2750.7            NaN
369                                          Vale   3982.0            NaN
371                         Shandong Energy Group     39.2            NaN
375                        Charter Communications   3522.0            NaN
397                                 LafargeHolcim   1817.9            NaN
422                                Idemitsu Kosan    813.7            NaN
429                        Datong Coal Mine Group   -214.8            NaN
430                                Lotte Shopping    144.9            NaN
443                                ConocoPhillips  -3615.0            NaN
444                  Yangquan Coal Industry Group     11.1            NaN
447                      Shanxi LuAn Mining Group   -106.9            NaN
456                               Heraeus Holding      NaN            NaN
472                                        Altice  -1722.5            NaN
473                                          Onex   -130.0            NaN
475  Shanxi Jincheng Anthracite Coal Mining Group      3.0            NaN
488                                Sears Holdings  -2221.0            NaN
492                                Telecom Italia   1999.4            NaN

[64 rows x 3 columns]

## 5. Working with Integer Labels (OPTIONAL)

Now let's check the difference between `DataFrame.loc[]` and `DataFrame.iloc[]` – what kind of different output will they provide?:

We can use `DataFrame.iloc[]`, and it will get us the following result:

In [25]:
# Only works if you have completed task 3.5.4

first_null_profit_change = null_profit_change.iloc[0]
print(first_null_profit_change)

company          Volkswagen
profits              5937.3
profit_change           NaN
Name: 5, dtype: object

But `DataFrame.loc[]` will throw an error:

In [26]:
first_null_profit_change = null_profit_change.loc[0]

KeyError: 'the label [0] is not in the [index]'

We get an error, telling us that **the label [0] is not in the [index]**. Remember that `DataFrame.loc[]` is used for label based selection:

- ``loc``: label based selection
- ``iloc``: integer position based selection

We see that there is no row with a 0 label in the index, we got the error above. If we wanted to select a row using `loc[]`, we'd have to use the integer label for the first row — `5`.

In [28]:
first_null_profit_change = null_profit_change.loc[5]
print(first_null_profit_change)

company          Volkswagen
profits              5937.3
profit_change           NaN
Name: 5, dtype: object

## 6. Pandas Index Alignment (OPTIONAL)
Do you know that pandas has a very powerful aspect? --- Almost every operation will <b>align on the index labels</b>. Let's look at an example below to understand what this means. We have a dataframe named `food` and a series named `alt_name`:

In [29]:
import pandas as pd
d = {'fruit_veg': ["fruit", "veg", "fruit", "veg","veg"], 'qty': [4, 2, 4, 1, 2]}
food = pd.DataFrame(data=d)
food.index = ['tomato', 'carrot', 'lime', 'corn','eggplant'] 
food

         fruit_veg  qty
tomato       fruit    4
carrot         veg    2
lime         fruit    4
corn           veg    1
eggplant       veg    2

In [30]:
alt_name = pd.Series(['rocket', 'aubergine', 'maize'], index=["arugula", "eggplant", "corn"])
alt_name

arugula        rocket
eggplant    aubergine
corn            maize
dtype: object

By observing the two dataframes above, we see that though the `food` dataframe and the `alt_name` series have different numbers of items, they share two of the same index labels which are `corn` and `eggplant`. However, these are in different orders. If we wanted to add `alt_name` as a new column in our `food` dataframe, we can use the following code:

In [31]:
food["alt_name"] = alt_name

food

         fruit_veg  qty   alt_name
tomato       fruit    4        NaN
carrot         veg    2        NaN
lime         fruit    4        NaN
corn           veg    1      maize
eggplant       veg    2  aubergine

When we perform the code above, pandas will intentionally ignore the order of the ``alt_name`` series, and automatically align on the index labels.

In addition, Pandas will also:

- Discard any items that have an index that doesn't match the dataframe (like `arugula`).
- Fill any remaining rows with `NaN`.

Observe the result again carefully.

In [32]:
# Below is the result
food

         fruit_veg  qty   alt_name
tomato       fruit    4        NaN
carrot         veg    2        NaN
lime         fruit    4        NaN
corn           veg    1      maize
eggplant       veg    2  aubergine

You see that with every occasion, the pandas library will align on index, no matter if our index labels are strings or integers - this makes working with data from different sources much much easier.

## 7. Using Boolean Operators (IMPORTANT)
We can combine boolean arrays using **boolean operators**. In Python, these boolean operators are `and`, `or`, and `not`. But in pandas, there is a slight difference compared to Python. Take a look at the chart below: 

|pandas|Python equivalent|Meaning|
|-|-|-|
|a & b| a and b| True if both a and b are True, else False|
| a \| b| a or b| True if either a or b is True|
|~a| not a | True if a is False, else False|

Let's try to use the syntaxes in the table in the small example below:

In [34]:
cols = ["company", "revenues", "country"]
f500_sel = f500[cols].head()
f500_sel.head()

                    company  revenues country
0                   Walmart    485873     USA
1                State Grid    315199   China
2             Sinopec Group    267518   China
3  China National Petroleum    262573   China
4              Toyota Motor    254694   Japan

We want to find the companies in `f500_sel` with more than 265 billion in revenue, and on top of that with headquarters located in China. We can achieve this by using two boolean comparisons like this:

In [35]:
over_265 = f500_sel["revenues"] > 265000
china = f500_sel["country"] == "China"
print(over_265.head())
print(china.head())

0     True
1     True
2     True
3    False
4    False
Name: revenues, dtype: bool
0    False
1     True
2     True
3     True
4    False
Name: country, dtype: bool

What we can do next is to use the `&` operator to combine the two boolean arrays to get the actual boolean we want, like this:

In [37]:
combined = over_265 & china
combined.head()

0    False
1     True
2     True
3    False
4    False
dtype: bool

Last but not least, we perform selection on our dataframe to get the final result like this:

In [38]:
final_cols = ["company", "revenues"]
result = f500_sel.loc[combined, final_cols]
result.head()

         company  revenues
1     State Grid    315199
2  Sinopec Group    267518

This is the end result which fulfills all of our criteria.

### Task 3.5.7
Now try to do a similar task by yourself:
1. Select all companies with revenues over **100 billion** and **negative profits** from the `f500` dataframe. Note that the entries in the profits column are given in millions of dollars (USD). The result should include all columns.
    - Create a boolean array that selects the companies with revenues greater than 100 billion. Assign the result to `large_revenue`.
    - Create a boolean array that selects the companies with profits less than `0`. Assign the result to `negative_profits`.
    - Combine `large_revenue` and `negative_profits`. Assign the result to `combined`.
    - Use combined to filter `f500`. Assign the result to `big_rev_neg_profit`.

In [40]:
# Start your code below:

large_revenue = f500["revenues"] > 100000
negative_profits = f500["profits"] < 0
combined = large_revenue & negative_profits
big_rev_neg_profit = f500[combined]

## 8. Sorting Values

Now let's try to answer some more complicated questions about our data set. What if we wanted to find the company that employs the most people in China? How can we achieve this? We can first select all of the rows where the `country` column equals `China`, like this:

In [41]:
selected_rows = f500[f500["country"] == "China"]

Then, we can use the [`DataFrame.sort_values()` method](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html) to sort the rows on the employees column, like this:

In [42]:
sorted_rows = selected_rows.sort_values("employees")
print(sorted_rows[["company", "country", "employees"]].head())

                                company country  employees
204                         Noble Group   China       1000
458             Yango Financial Holding   China      10234
438  China National Aviation Fuel Group   China      11739
128                         Tewoo Group   China      17353
182            Amer International Group   China      17852

The `sort_values()` method will by default automatically sort the rows in ascending order — from smallest to largest.

But if we want to sort the rows in descending order instead, we can achieve this by setting the `ascending` parameter to `False`, like this:

In [43]:
sorted_rows = selected_rows.sort_values("employees", ascending=False)
print(sorted_rows[["company", "country", "employees"]].head())

                        company country  employees
3      China National Petroleum   China    1512048
118            China Post Group   China     941211
1                    State Grid   China     926067
2                 Sinopec Group   China     713288
37   Agricultural Bank of China   China     501368

Now we see the Companies in China who employ the most people is China National Petroleum. 

Can you find out the same about Japanese company?
### Task 3.5.8

1. Find the companies headquartered in Japan with the largest number of employees.
    - Select only the rows that have a country name equal to `Japan`.
    - Use `DataFrame.sort_values()` to sort those rows by the `employees` column in descending order.
    - Use `DataFrame.iloc[]` to select the first row from the sorted dataframe.
    - Extract the company name from the index label `company` from the first row. Assign the result to `top_japanese_employer`.

In [104]:
# Start your code below:

japan = f500[f500["country"] == "Japan"]
sorted_rows = japan.sort_values("employees", ascending=False)
top_japanese_employer = sorted_rows.iloc[0,]
top_japanese_employer = top_japanese_employer.loc["company"]